'''
Дан произвольный список. Вывести на экран в обратном порядке. 
Задачу решить 2мя способами. 
'''

list1 = [1, 2, 3, 4, 5]

# 1
print(list1[::-1])

# 2
list1.reverse()
print(list1)
